//--------------------------------------------------
// 친구관리 프로토콜
//
//
//--------------------------------------------------

#define dfNETWORK_PORT		25000

#define dfNICK_MAX_LEN		20
#define dfPACKET_CODE		0x89


//------------------------------------------------------
//  패킷헤더
//
//	| PacketCode | MsgType | PayloadSize | * Payload * |
//		1Byte       2Byte      2Byte        Size Byte     
//
//------------------------------------------------------

#pragma pack(push, 1)   

struct st_PACKET_HEADER
{
	BYTE	byCode;

	WORD	wMsgType;
	WORD	wPayloadSize;
};

#pragma pack(pop)


//------------------------------------------------------------
// 회원가입 요청
//
// {
//		WCHAR[dfNICK_MAX_LEN]	닉네임
// }
//------------------------------------------------------------
#define df_REQ_ACCOUNT_ADD				1

//------------------------------------------------------------
// 회원가입 결과
//
// {
//		UINT64		AccountNo
// }
//------------------------------------------------------------
#define df_RES_ACCOUNT_ADD				2



// ## 컨텐츠 서버와의 통신하는 서버 이므로  본래 로그인 이라는 개념은 필요가 없습니다.
// ## 그런데 로그인 이라는 기능이 있는 이유는  테스트 클라이언트에서 매번 요청자 AccountNo 를 입력하기가 
// ## 번거로운 관계로 연결된 세션에 대하여 '로그인' 이라는 과정을 통해서 요청자의 AccountNo 를 서버측 세션에 보관 해두기 위해서 입니다.
// ## 그래서 로그인 후에는 친구요청,수락,거부 등의 모든 행동 메시지에 요청자 AccountNo 가 생략되고 있습니다.
//
// ## 실제 서비스 목적의 서버로서 개발을 한다면 회원 로그인 이라는 과정은 없어져야 하며,
// ## 친구 목록 Req / 친구요청 Req / 수락 Req 등 서버에게 요청하는 보든 과정에 요청자 AccountNo 가 포함 되어야만 합니다.

//------------------------------------------------------------
// 회원로그인
//
// {
//		UINT64		AccountNo
// }
//------------------------------------------------------------
#define df_REQ_LOGIN					3

//------------------------------------------------------------
// 회원로그인 결과
//
// {
//		UINT64					AccountNo		// 0 이면 실패
//		WCHAR[dfNICK_MAX_LEN]	NickName
// }
//------------------------------------------------------------
#define df_RES_LOGIN					4



//------------------------------------------------------------
// 회원리스트 요청
//
// {
//		없음.
// }
//------------------------------------------------------------
#define df_REQ_ACCOUNT_LIST				10

//------------------------------------------------------------
// 회원리스트 결과
//
// {
//		UINT	Count		// 회원 수
//		{
//			UINT64					AccountNo
//			WCHAR[dfNICK_MAX_LEN]	NickName
//		}
// }
//------------------------------------------------------------
#define df_RES_ACCOUNT_LIST				11




//------------------------------------------------------------
// 친구목록 요청
//
// {
//		없음
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_LIST				12

//------------------------------------------------------------
// 친구목록 결과
//
// { 
//		UINT	FriendCount
//		{
//			UINT64					FriendAccountNo
//			WCHAR[dfNICK_MAX_LEN]	NickName
//		}	
// }
//------------------------------------------------------------
#define df_RES_FRIEND_LIST				13






//------------------------------------------------------------
// 친구요청 보낸 목록  요청
//
// {
//		없음
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_REQUEST_LIST		14

//------------------------------------------------------------
// 친구목록 결과
//
// {
//		UINT	FriendCount
//		{
//			UINT64					FriendAccountNo
//			WCHAR[dfNICK_MAX_LEN]	NickName
//		}	
// }
//------------------------------------------------------------
#define df_RES_FRIEND_REQUEST_LIST		15




//------------------------------------------------------------
// 친구요청 받은거 목록  요청
//
// {
//		없음
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_REPLY_LIST		16

//------------------------------------------------------------
// 친구목록 결과
//
// {
//		UINT	FriendCount
//		{
//			UINT64					FriendAccountNo
//			WCHAR[dfNICK_MAX_LEN]	NickName
//		}	
// }
//------------------------------------------------------------
#define df_RES_FRIEND_REPLY_LIST		17



//------------------------------------------------------------
// 친구관계 끊기
//
// {
//		UINT64	FriendAccountNo
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_REMOVE			20

//------------------------------------------------------------
// 친구관계 끊기 결과
//
// {
//		UINT64	FriendAccountNo
//
//		BYTE	Result
// }
//------------------------------------------------------------
#define df_RES_FRIEND_REMOVE			21

#define df_RESULT_FRIEND_REMOVE_OK			1
#define df_RESULT_FRIEND_REMOVE_NOTFRIEND	2
#define df_RESULT_FRIEND_REMOVE_FAIL		3



//------------------------------------------------------------
// 친구요청
//
// {
//		UINT64	FriendAccountNo
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_REQUEST			22

//------------------------------------------------------------
// 친구요청 결과
//
// {
//		UINT64	FriendAccountNo
//
//		BYTE	Result
// }
//------------------------------------------------------------
#define df_RES_FRIEND_REQUEST			23

#define df_RESULT_FRIEND_REQUEST_OK			1
#define df_RESULT_FRIEND_REQUEST_NOTFOUND	2
#define df_RESULT_FRIEND_REQUEST_AREADY		3




//------------------------------------------------------------
// 친구요청 취소
//
// {
//		UINT64	FriendAccountNo
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_CANCEL			24

//------------------------------------------------------------
// 친구요청취소 결과
//
// {
//		UINT64	FriendAccountNo
//
//		BYTE	Result
// }
//------------------------------------------------------------
#define df_RES_FRIEND_CANCEL			25

#define df_RESULT_FRIEND_CANCEL_OK			1
#define df_RESULT_FRIEND_CANCEL_NOTFRIEND	2
#define df_RESULT_FRIEND_CANCEL_FAIL		3




//------------------------------------------------------------
// 친구요청 거부
//
// {
//		UINT64	FriendAccountNo
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_DENY				26

//------------------------------------------------------------
// 친구요청 거부 결과
//
// {
//		UINT64	FriendAccountNo
//
//		BYTE	Result
// }
//------------------------------------------------------------
#define df_RES_FRIEND_DENY				27

#define df_RESULT_FRIEND_DENY_OK			1
#define df_RESULT_FRIEND_DENY_NOTFRIEND		2
#define df_RESULT_FRIEND_DENY_FAIL			3




//------------------------------------------------------------
// 친구요청 수락
//
// {
//		UINT64	FriendAccountNo
// }
//------------------------------------------------------------
#define df_REQ_FRIEND_AGREE				28

//------------------------------------------------------------
// 친구요청 수락 결과
//
// {
//		UINT64	FriendAccountNo
//
//		BYTE	Result
// }
//------------------------------------------------------------
#define df_RES_FRIEND_AGREE				29

#define df_RESULT_FRIEND_AGREE_OK			1
#define df_RESULT_FRIEND_AGREE_NOTFRIEND	2
#define df_RESULT_FRIEND_AGREE_FAIL			3









//------------------------------------------------------------
// 스트레스 테스트용 에코
//
// {
//			WORD		Size
//			Size		문자열 (WCHAR 유니코드)
// }
//------------------------------------------------------------
#define df_REQ_STRESS_ECHO				100

//------------------------------------------------------------
// 스트레스 테스트용 에코응답
//
// {
//			WORD		Size
//			Size		문자열 (WCHAR 유니코드)
// }
//------------------------------------------------------------
#define df_RES_STRESS_ECHO				101

